[
  {
    "year": "2020",
    "projects": [
      {
        "name": "Projects 2020 Example 1",
        "link": "https://hackbeanpot-2020.devpost.com/submissions/140714-garbage-ai",
        "creator": "Creators",
        "description": "Description",
        "award": "Award Name"
      },
      {
        "name": "Projects 2020 Example 2",
        "link": "https://hackbeanpot-2020.devpost.com/submissions/140714-garbage-ai",
        "creator": "Creators",
        "description": "Description",
        "award": ""
      }
    ]
  },
  {
    "year": "2019",
    "projects": [
      {
        "name": "Loot",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111907-loot",
        "creator": "Spenser Cheung, Cari Liu, Chess Myers, Michelle Kang, Patrick Hanbury, and Terry Chen",
        "description": "An e-commerce platform tailored to your preferences. Who knows, maybe you'll discover some hidden treasure!",
        "award": "Best UI/UX Award and Moltin's API Award"
      },
      {
        "name": "Facebook Audit",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111895-facebook-audit",
        "creator": "Julian Zucker, Sam Xifaras, Michael Wheeler, and Daniel Rassaby",
        "description": "Audit all the data that facebook has on you and the amount of interactions you've had with facebook. We extracted as much data as we could from Facebook's data export, and then we created a client-side app that would visualize it. It is important that the app be client side - your full Facebook history is very sensitive data and users shouldn't have to give up their privacy (by uploading their data) in order to visualize it.",
        "award": "Hack to Give Back"
      },
      {
        "name": "CrimePot",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111885-crimepot",
        "creator": "Kyle Posluns, Daniel Wang, Stanley Liu, Pratheek Hegde, and Sauharda Rajbhandari",
        "description": "Web app for viewing criminal activity near you. A project that uses the data from the Crime Incident Reports provided by the Boston Police Department.",
        "award": "Rookie of the Year"
      },
      {
        "name": "VODCA",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111798-vodca",
        "creator": "Jack McNally, Swati Joshi, and Jack Baxter",
        "description": "Computes how much every stock in the S&P 500 is under/over values, and gives the percentages back in a sorted list. Scrapes the data from each web page for all 500 companies on the S&P 500, and determines how much the stock is over or undervalued from the data it collects.",
        "award": "Most Technically Challenging"
      },
      {
        "name": "Foodies",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111930-foodies",
        "creator": "Mathias Kools, Jake Kinsella, Harry Mirzen, Michael Fitzgibbons, and Maxwell Salvadore",
        "description": "College students have too many bad choices. We make a bad choice for them with mobile one-click random food delivery."
      },
      {
        "name": "Lost & Find",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111922-lost-find",
        "creator": "Nawach Kuptimanus, Hsin Hung Wu, Paschal Igusti, and Kenneth Kim",
        "description": "A lost and found with reward system similiar to bounty hunting."
      },
      {
        "name": "aesthetify",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111909-aesthetify",
        "creator": "Niklas Pousette Harger, Lynnsey Martin, and Verda Bursal",
        "description": "aesthetify is a web application that graphically models various metrics about any song on Spotify."
      },
      {
        "name": "InstaReader",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111908-instareader",
        "creator": "Aaron Pradhan, Luke Janik, Peter Teixeira, Diana Sinyukova, and Alina Lam",
        "description": "Accessibility for the visually impaired on social media is unacceptable. AI technologies can be used to enhance this. We used machine learning algorithms and data scraping to form full sentences about the media post, allowing the user to generate the best mental image possible."
      },
      {
        "name": "Debugging is music to my ears",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111718-debugging-is-music-to-my-ears",
        "creator": "Aaron Elliot, Kevin Liang, Brandon Chen, and Ashley Deshields",
        "description": "Make debugging less boring by adding music. Your debugger now has music. Your code is now a dj. You hate your code? Upload a .wav of Friday by Rebecca Black to match."
      },
      {
        "name": "reCursor",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111870-recursor",
        "creator": "Edgar Maldonado, Dania Alnahdi, and Alanna Pasco",
        "description": "reCursor is a Google Chrome extension that allows you to customize your cursor with a theme of icons! There are five different themes that each contain their own set of icons. Every time you click anywhere on your webpage, the cursor will change too!"
      },
      {
        "name": "Stock Stalker",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111905-stock-stalker",
        "creator": "Nikita Uppal, Anjali Thakkar, Mahema Singh, and Kyle Sferrazza",
        "description": "An easier way to build an algorithm to trade stocks. Users can easily specify the desired behaviour for trading."
      },
      {
        "name": "Picspire",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111901-picspire",
        "creator": "John Abreu, Edsel Rudy, Subraiz Ahmed, and Jolene Lozano",
        "description": "Have you ever tried taking the perfect picture in a new place but your pictures are never quite as nice as all these Instagram photographers? Well, Picspire is just for you! Picspire is a camera app that presents you with photography inspiration right from Instagram."
      },
      {
        "name": "Tasteless",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111894-tasteless",
        "creator": "Dora Agali, Caolan Disini, and Kamoltat Sirivadhna",
        "description": "Tasteless rates your Spotify library and tells you if you need to reevaluate your choices in music and/or life. Built with Flask, Spotify and Indico API, Tasteless uses \"state-of-the-art\" Sentiment-Analyzing AI From The Future™ to search the web for music reviews of all your favorite songs, in order to calculate your Music Appreciation Score. If your idea of a fun time is having more things to be insecure about, maybe Tasteless is the app for you."
      },
      {
        "name": "tARnks",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111883-tarnks",
        "creator": "Raymond Huang, Shane Timmerman, Megan Lau, and Katie Busemeyer",
        "description": "A multiplayer augmented reality game with tanks and buildings. We found an API that would lets you build a 3d model of a real life city. We wanted to use this technology to reconstruct a city in augmented reality, and explore and destroy that city using tanks, like in the Wii U game, Tanks."
      },
      {
        "name": "Meme Economy 2.0",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111871-meme-economy-2-0",
        "creator": "Ciarra Peters, Kenneth See Dehui, Avery Peterson, Amal Nazeem, and Manas Purohit",
        "description": "We are an analytics platform for meme relevance. Meme freshness is an important metric on the success of a meme. Us as individuals have been very tired of seeing stale memes online; it's been a huge pain point in our lives, and we never want anyone to have to see a stale meme again."
      },
      {
        "name": "fan-tastic_food",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111863-fan-tastic_food",
        "creator": "Jordan Nichols, Paul Stephen Hutchinson Maltaghati, Xavier Ruiz, Gagandeep Kang, and Keshav Maheshwari",
        "description": "Web app designed for use in stadiums/arenas. User orders food from vendors online and is notified when it is ready."
      },
      {
        "name": "exPLAIN Campaign",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111856-explain-campaign",
        "creator": "Katherine Huang",
        "description": "Science communication is all about making big ideas interesting and clear for different audiences. It can be challenging, but everyone's an expert on some topic, and anyone can practice it! Don't let me just tell you what science communication is—let the exPLAIN Campaign show you: complex topics in plain words."
      },
      {
        "name": "BeanPolitics",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111708-beanpolitics",
        "creator": "Adam Fleishaker, Mitchell Dodell, Reese Farquhar, Prabu Gugagantha, and Jonah Sander",
        "description": "A fun, educational, and information-rich hub app for all things politics! Want to find out who represents you? Use the Civic Info Hub to become informed on your local representatives and how to contact them! Utilizes the Google Civic Information API & Google Maps Autocomplete API."
      },
      {
        "name": "DITI",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111821-diti",
        "creator": "Michelle Lee, Shivani Deodhar, Dhanashri Palodkar, and Abhijit Menon",
        "description": "A \"To-Do\" list application that analyses the sentiment behind your list and plays songs based off of the sentiment."
      },
      {
        "name": "TL;DR",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111819-tl-dr",
        "creator": "Skylar Gilfeather, Aya Aragon, Nesanne Mae Tam, Anirudh Kaushik, and Vikram Kaushik",
        "description": "TL;DR analyses a constant incoming feed of news articles and develops a notion of \"trending stories\" from this. It then finds other articles that are also part of the trending stories and consolidates (summarizes) the articles into one summary. The summary is then presented to the user so that they can quickly understand the relevant information from a story."
      },
      {
        "name": "volunTIER",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111755-voluntier",
        "creator": "Trevor Stenson, Nithin Saripalli, Rahul Suryadevara, and Erin Wang",
        "description": "Essentially it is a fitbit like application for volunteering. This website includes a social aspect to the volunteering."
      },
      {
        "name": "Yo-setta Stone",
        "link": "https://hackbeanpot-2019.devpost.com/submissions/111727-yo-setta-stone",
        "creator": "Nathan Levy and Sarah Rieger",
        "description": "A web application using NLP to create definitions for slang words based on context from tweets"
      }
    ]
  },
  {
    "year": "2018",
    "projects": [
      {
        "name": "Emotiquote",
        "link": "https://abigailhodge.github.io/emotiquote/",
        "creator": "Abigail Hodge, Michelle Pine, Sharon He, Sam Price",
        "description": "Our interests in machine learning and web dev/UI prompted us to develop a web application which handles the Indico API and Mediawiki API to enable emotional analysis of very large and interesting datasets, namely, famous quotes (drawn from Wikiquotes).",
        "award": "Best Visual Award!"
      },
      {
        "name": "CoOperate",
        "link": "https://github.com/adjkant/hackbeanpot-2018",
        "creator": "Campbell Alden, Kimberly Whitney, Jessica Rouzan, and Adrian Kant",
        "description": "Like TRACE reviews for co-ops but anonymous",
        "award": "Hack to Give Back Award!"
      },
      {
        "name": "Nudge",
        "link": "https://github.com/sbernal2018/HackBeanPot2018",
        "creator": "Sebastian Bernal, Alejandro Baez, Marc Estrada, Greg Kimatov, and Rocktem Bhowmik",
        "description": "Have you ever fallen asleep on a bus/train and then missed your stop? Sleep deprivation is a common problem, especially among students. So, we created a mobile application called Nudge that is able to wake you up with a customizable alarm shortly before you reach your destination.",
        "award": "Rookie of the Year Award and Genuine's #InventTogether Award!"
      },
      {
        "name": "Scout Robotic Pet",
        "link": "https://github.com/domyam97/Scout",
        "creator": "Devendra Shivraj and Mark Yamarone",
        "description": "We made a small robot with a camera and a couple sensors on it, to allow it to find and follow it's best friend: you!  ",
        "award": "Most Technically Challenging Award and TriNetX's Best Use Of Data Award!"
      },
      {
        "name": "cap.py",
        "link": "https://github.com/Shinabel/Cap.py",
        "creator": "Daniel Chen, Abel Shin, Elizabeth Cho, Caitlin Wang, Brandon Yip, and Duk Hwan Kim",
        "description": "Uploading a photo to your favorite social media platform is always a struggle when you can't think of the perfect caption. With cap.py, never worry again that your caption is holding back your image from getting the attention it deserves.",
        "award": "PowerAdvocate's Most Useful for the Everyday and Rough Draft Venture's Most Entrepreneurial Hack!"
      },

      {
        "name": "Bringing Genius to Spotify Desktop",
        "link": "https://github.com/timmermansh/HBP2018",
        "creator": "Shane Timmerman",
        "description": "Not many people know that the Spotify desktop app has a designated full screen mode. Even fewer people actually the bland and tasteless feature. On accasion I have found myself listening just putting on a song on computer and just wishing I could do something more with my screen space, similar how Spotify's android apps use their space. Putting a highlight on album art and real time lyrics display, similar Genius feature on their mobile app, I built a minimal player to help proof out the concept. The backend is written in Python on a Windows platform, while the front-end was coded using Kivy. This helped me play around more within the front-end development space."
      },
      {
        "name": "Genuine Dogs",
        "link": "https://github.com/mfleisch5/dog_recognizer",
        "creator": "Michael Fleisch, Becker Ewing, JdD Mullally, Travis Bergmann, and Brandon Gioggia",
        "description": "We made an app to recognize the breed/breeds of your dog using the Indico API. We have future plans to expand this idea to allow people to reconnect lost dogs with their owners."
      },
      {
        "name": "Scavvy",
        "link": "https://github.com/MiaF17/Scavvy",
        "creator": "Kate Rupar and Mia Fryling",
        "description": "We created a game using Apples CoreML and Vision framework. The game is essentially a scavenger hunt, where the user is given the name of an item to find in 30 seconds and they only gain a point when the image recognizers sees it. There are 3 modes available, each based off of a different mlmodel; Food, Emotion, and Objects."
      },
      {
        "name": "Aerodust",
        "link": "https://github.com/dgiese/aerodust",
        "creator": "Dennis Giese and Andrew Tu",
        "description": "We used recently rooted COTS vacuum robots to map Wifi networks and rooms. In addition to that we played around with different usecases (webradio, etc)."
      },
      {
        "name": "Connect Zero",
        "link": "#",
        "creator": "Kevin Luo and David Zhao",
        "description": "Alpha zero based connect 4 ai"
      },
      {
        "name": "ZodiHacks",
        "link": "zodihacks.tk",
        "creator": "Kelsey Esposito, Olivia Petrillo, Caitlin Rossi, Willa Shiomos, Anjali Thakkar, and Sarah Witt",
        "description": "Our project is a website that predicts a person's zodiac sign based on their text input. We like to have fun and thought this was a fun idea for a project! This is our first hackathon so we tried to think outside of the box and do something different and doable given our limited experience and the time constraints. We started this project by using Indico's text analysis API for personas for Python. Then, we used Flask, html, and css to get the website up and running."
      },
      {
        "name": "RedditMyersBriggs",
        "link": "http://davidmalakh.com/RedditMyersBriggs/dist/",
        "creator": "David Malakh and Skyler Szot",
        "description": "It uses the Indico API to analyze Myers Briggs personas of self text posts on specific subreddits. (Reddit data was collected through the PushShift Reddit API). This project allows anyone to see some interesting data about their favorite subreddits and what the personas are of people posting on them."
      },
      {
        "name": "Glenn's Game",
        "link": "https://github.com/feliciazhang/GlennsGame",
        "creator": "",
        "description": "For our friend/roommate's 20th birthday, we decided to code her a game based on her life, sort of a 'Choose Your Own Adventure' filled with inside jokes and silly references (i.e: the final boss is Barry Dwight, a porcelain duck one of the team members brought from Portland that everyone hates and who they've all started a conspiracies against) None of us have ever worked with Unity before but it was the best framework for what we wanted to do so we just dove in. What we have is the basic skeleton of it and we plan to add more scenes before her actual birthday (March 11)."
      },
      {
        "name": "Connect Partify",
        "link": "https://github.com/aminaly/AMusicThing",
        "creator": "Durward Benham and Amina Ly",
        "description": "A service that allows you to take an existing Spotify playlist, and optimize it's play order for parties and other events"
      },
      {
        "name": "Raven Messenger",
        "link": "https://github.com/raven-messenger/raven-app",
        "creator": "Kyle Sferrazza, Ian Wolterstorff, Trevor Stenson, Bryce Thuilot, and Ryan Drew",
        "description": "We (almost) made a messaging app for Android that generates secure One Time Pads (OTPs) as scannable QR codes, and then allows secure messaging with friends using those OTPs."
      },
      {
        "name": "Emosic",
        "link": "https://github.com/KaranTyagi/emotion-detection-music-player",
        "creator": "Karan Tyagi",
        "description": "Used Microsoft Azure Emotion Detection API and python."
      },
      {
        "name": "Polarizing Opinion Sentiment Analysis",
        "link": "https://github.com/crystalrhee/hackbeanpot",
        "creator": "Olivia Wan, Crystal Rhee, and Sarah Zhang",
        "description": "Uses an indico.io model trained on for/against arguments for various divisive topics such as gun control, climate change, etc. to predict the viewpoint of a given text passage."
      },
      {
        "name": "Blockchain Messaging",
        "link": "https://github.com/nsaripalli/messaging-blockchain",
        "creator": "Edward Shen, Jacob Bernhardt, Nithin Saripalli, and Khalil Haji",
        "description": "Java instant messaging with blockchain encryption"
      },
      {
        "name": "Nature Calls",
        "link": "https://github.com/jbhoffman613/FeejBeanpot",
        "creator": "Josh Hoffman, Justin Konecny, Matt Martin, and Steve Setteducati",
        "description": "Imagine you are touring NYC, you have been enjoying the day, eating a ton of food and staying well hydrated. Suddenly, Nature Calls, and you have no idea where the nearest bathroom is. We hope to solve that, we attempted to make an app that will take your location, and show you the nearest bathrooms. So when nature calls, you know where to run to."
      },
      {
        "name": "Mood Song",
        "link": "https://github.com/hontoriae/mood-song",
        "creator": "Joseph Gabay, Axel Simms, Emily Hontoria, and Anjaneya Naik",
        "description": "Using a webcam, this app takes a picture of your face and uses the Indico API to detect your mood. From here, it matches your mood with a song from a pool of over 180 top songs that have had their lyrics analyzed with the Indico API. It then plays your 'mood song' through spotify."
      },
      {
        "name": "Lucid VCS",
        "link": "https://github.com/caseyz/lucid",
        "creator": "Milo Turner, Zach Casey, and Kira Evans",
        "description": "Version control system, controlled by interacting with a text file on emacs, uses 'patch theory' to calculate merge, commute etc."
      },
      {
        "name": "Dadabots",
        "link": "http://github.com/cortexelus/nofxbot",
        "creator": "CJ Carr, Zack Zukowski, and Bryan Robinson",
        "description": "Used a recurrent neural network to train a raw-audio model on punk band NOFX, generated a song that definitely sounds like NOFX but with nonsense lyrics."
      },
      {
        "name": "Get Together",
        "link": "https://www.github.com/donnellycolton/hbp2018front",
        "creator": "Colton Donelly, Aditya Jalan, and Daniel Melcer",
        "description": "An event management app which covers every aspect of an event, 'from organizing an event to reaching the venue on time' The app, after 2 nights of work, boasts of a login page with persistent login capability and secure password storage on server, as well as a task assignment functionality, aimed at making an event more efficient by distributing tasks among the attendees. While the client side of the application does not yet support task assignment, the server is prepared to assign tasks within the group to specific members or to the group as a whole. The application gives the user the control to create his own private 'party-space' to which he can invite other members through a personalized code, and assign tasks and requirements for the party to fellow attendees. \nFuture prospective improvements include but are not limited to event decisions within events, for e.g a Pepsi v/s Coke poll; Venue mapping and Uber/Lyft integration within the App; 'Wishlist' integration; option to look up and buy tickets to public events; dedicated group chats and inter-personal chat bubbles; calendar integration for appropriate reminders of events; and even the functionality of booking venues through the app, in the long run, among tons of other features."
      },
      {
        "name": "CourseOn",
        "link": "https://github.com/PriscaJ/HackBeanpot2018.git",
        "creator": "Prisca Joseph, Sarah Wessel, Rucha Khanolkar, and Megan Lau",
        "description": "CourseOn is a web application to help students to organize which courses they need to take throughout their time at Northeastern. This allows students to generate their grad plan easily, dynamically, and interactively."
      },
      {
        "name": "pupDate",
        "link": "https://github.com/annachoi4/pupDate",
        "creator": "Anna Choi, Andres Rodriguez, Gabriella Roman, and Christopher Trinh",
        "description": "A web application for dog owners to find their dogs some nearby playmates, since Anna owns a dog and is always looking for playmates! Made in PyCharm."
      },
      {
        "name": "Joe & Pedro's",
        "link": "https://github.com/phrmsilva/HBPTweetGenerator",
        "creator": "Pedro Silva and Joe Donovan",
        "description": "Our project identifies your music preferences based on how your twitter compares to those of artists' fanbases"
      },
      {
        "name": "Live sentiment analysis",
        "link": "https://github.com/divyavijaysahay/Sentiment-analysis",
        "creator": "Divyavijay Sahay, Brian, and Tram",
        "description": "We created a system which can perform sentiment analysis on live video and sound. This system can be used in numerous ways like for psychiatrist consultation, audience reaction and also with some more functionality blind/deaf person can use this system to analyse their surrounding."
      },
      {
        "name": "Chlobber",
        "link": "https://github.com/coderrick/Chlobber",
        "creator": "Derrick Duncan",
        "description": "Command-line utility that helps you restore your lost Chrome browsing sessions and tabs"
      },
      {
        "name": "PaperStx",
        "link": "https://github.com/Jakobeha/PaperStx",
        "creator": "Jakob Hain",
        "description": "An editor for block syntax, like the syntax in Scratch. It's a webpage/webapp whose custom logic is entirely client-side (e.g. you don't need a server to run it, you can just load the HTML file). \nThe block syntax has basic types. Not every block can be connected to every other block. The blocks are colored, and they're have colored 'holes' for other blocks - the only blocks which can go in a hole are the ones with one of the holes' colors. \nFirst, you create a template file. You follow a very simple DSL to either create your own block syntax or recreate an existing one (e.g. Scratch). Then, you upload this file to the webpage. Then, the webpage will give you all of the different block syntax forms, grouped by class. You can drag them onto a canvas, and create your block syntax."
      },
      {
        "name": "Spot a Match",
        "link": "https://github.com/tylercote/spot-a-match",
        "creator": "Megan Larson, Dan, Julian, and Tyler",
        "description": ""
      }
    ]
  },
  {
    "year": "2017",
    "projects": [
      {
        "name": "Infinity Warp Drive",
        "link": "https://github.com/jeruane/infinitecloudstorage",
        "creator": "Eric Parker, Joseph Ruane, and Trevor Sanders",
        "description": "We offer a solution to get infinite cloud storage for free!",
        "award": "Least Likely to Make Money Award!"
      },
      {
        "name": "Crowd DJ",
        "link": "https://github.com/crowddj/crowddj-react",
        "creator": "Brittany Chiang, Camden Phalen, John Martin, Ben Campbell, Drew Pomerleau, and Julie Tennett",
        "description": "Crowd DJ is a web app that allows people who are at a party or social gathering with a DJ to request songs via their smartphones. The web app allows people to see the currently playing song, request songs, upvote songs, and rate songs so the DJ can see how the crowd is feeling and act accordingly. In other words, Crowd DJ is essentially a crowdsourced music queue.",
        "award": "Best Visual/UI/UX Design Award!"
      },
      {
        "name": "ProjectDumpster",
        "link": "https://github.com/seanolly/ProjectDumpster",
        "creator": "Sean Connolly and Ernie Hao",
        "description": "Minecraft plus guns, minus the crafting.",
        "award": "Team Frosh Award!"
      },
      {
        "name": "EmojiScript",
        "link": "https://dan3944.github.io/emojiscript/",
        "creator": "Daniel Cohen, Nathan Goodman, and Milo Turner",
        "description": "A modern, dynamically typed, state-of-the-art programming language that, for the first time ever, brings emojis to the playing field in language syntax.",
        "award": "Most Fun Award!"
      },
      {
        "name": "SecureStash",
        "link": "https://github.com/keithemiller/beanpot",
        "creator": "Keith Miller, Carter McCardwell, and Douglas Schonholtz",
        "description": "SecureStash is a pill/liquor cabinet built to prevent teens from abusing their parents drugs. Using facial recognition we can authenticate users who are allowed to access certain compartments as well as capture who was trying to break in.",
        "award": "Most Technically Challenging Award!"
      },
      {
        "name": "Spill.it",
        "link": "https://github.com/breedy231/spillit",
        "creator": "Jon Corbett, Brendan Reed, Noah Appleby, and Alex Lim",
        "description": "A party game using the indico API to have your friends spill the tea.",
        "award": "1st in Best Use of indico's API!"
      },
      {
        "name": "InTune",
        "link": "https://github.com/feliciazhang/in-tune",
        "creator": "Catalina Berretta, Felicia Zhang, Ashna Shah and Teddy Sevilla",
        "description": "Be the star of your own life film. Enter a journal entry and InTune will analyze your moods to build a playlist that is a soundtrack of your day.",
        "award": "2nd in Best Use of indico's API!"
      },
      {
        "name": "Birdsong",
        "link": "https://github.com/wet-cole/birdsongbot",
        "creator": "Nabeel Sherazi, Kyle Coelho, Cole Wuilleumier, Noah Sirin, and Khang Bui",
        "description": "A Twitter bot that intelligently distinguishes haikus leveraging the latest advancements in machine learning technology and plays an accompanying musical arrangement to fit the sentiment of the text.",
        "award": "3rd in Best Use of indico's API and won Genuine's #InventTogether Award!"
      },
      {
        "name": "Artist Expander",
        "link": "https://github.com/jzimbel/artist-expander",
        "creator": "Jon Zimbel",
        "description": "Build a Spotify playlist of top tracks from artists for which you have only 1 track saved. Helps you find more music from artists you've already shown interest in, but haven't explored fully yet."
      },
      {
        "name": "Fluff you, autocorrect!",
        "link": "https://github.com/hontoriae/autocorrect",
        "creator": "Olivia Wan, Emily Hontoria, and Alex Huntoon",
        "description": "Replaces any swears typed with random nice words! :D"
      },
      {
        "name": "Medicompare",
        "link": "https://github.com/CodingItForward/medicompare",
        "creator": "Neel Mehta and Allison Kao",
        "description": "A web application that helps patients find the cheapest medical procedures in their area and gives them access to hidden healthcare costs."
      },
      {
        "name": "Looseleaf",
        "link": "http://looseleaf-app.herokuapp.com/",
        "creator": "Julia Ebert and Clark Teeple",
        "description": "Need to keep track of all those notes and code snippets with your group? Meet Looseleaf! Looseleaf is a mobile-friendly web app that lets you organize notebooks of math, code, and text notes to collaborate with your team. Leaf your notes here and set loose your imagination!"
      },
      {
        "name": "Search Smarter",
        "link": "https://github.com/l-tn3314/SearchSmarterChromeExtension",
        "creator": "Raveena Jain, Shravali Reddy, and Tina Lee",
        "description": "Not getting the right search results when performing a Google search? With our Chrome extension, getting better search results it super easy!"
      },
      {
        "name": "Chase Morgan",
        "link": "https://github.com/xPowerz/Chase-Morgan",
        "creator": "Chet Powers, Max Mesirow, Mariana Dematte, and Rudhra Raveendran",
        "description": "Generate memes with macheme learning."
      },
      {
        "name": "Overscheduled",
        "link": "https://github.com/monsuratolaosebikan/overscheduled/",
        "creator": "Monsurat Olaosebikan, Yifan Xing, Jovaun Jackson, and John Williams",
        "description": "Forget having to schedule everything yourself, let Overscheduled do it for you. Fair warning, you might actually be overscheduled."
      },
      {
        "name": "SGJ",
        "link": "https://github.com/sarahchou/AgeRecognition",
        "creator": "Sarah Chou, Grace Hall, and Jamie Cirne",
        "description": "Our idea was an iOS application that uses the camera and/or photo library to upload a picture and using Watson (IBM's API) will be able to find missing kids or human traffickers and display information about them such as gender, age range, and facial expression. But what we ended up accomplishing (since it was our first time using Swift and Xcode, was an application that could change the background of the app based on the photo taken or uploaded. Also includes a dummy html page that shows information that IBM's Watson API WOULD produce after viewing the photo and detecting facial features such as age, gender, and expressions."
      },
      {
        "name": "PhotoQuest",
        "link": "https://github.com/ray10102/HackBeanpot-2017-Photo-Quest",
        "creator": "James Roberts, David Silva, Kait Sousa, Maxime Gautier, Raymond Huang, Anna Buchele, and Oscar Coen"
      },
      {
        "name": "HappyTweet",
        "link": "https://github.com/Arod15/HappyTweet",
        "creator": "Warren Partridge, Ashley Deshields, Kevin Liang, Andres Rodriguez, Duy Nguyen, Gaspard Etienne, and Ryan Karjadi",
        "description": "Ever wonder how happy you sound to others on Twitter? Or how sad? Or angry? Well, now you can use this Beanie Babies project to find out! You'll also be able to tell how other local Twitter users sound through their tweets, as well!"
      }
    ]
  },
  {
    "year": "2016",
    "projects": [
      {
        "name": "Ragtag",
        "link": "https://github.com/djkazic/ragtag",
        "creator": "Brittany Chiang, Kevin Cai, and Teddy Burns",
        "award": "Most Technically Challenging"
      },
      {
        "name": "PoliTweet",
        "link": "https://github.com/mgramigna/presidential-live-tweets",
        "creator": "Justin Kennedy, Andrew Bass, Mathew Gramigna, and Jack Nichols",
        "award": "Best Visual/UI/UX Design"
      },
      {
        "name": "Foam",
        "link": "https://github.com/LivD1125/HackBeanpot-Team-Foam.git",
        "creator": "Dylan Boudro, Erika McVey, Abhijeet Sharma, Olivia DeFlumeri, Nadine Shaalan, and Bahar Haji-Sheikhi",
        "award": "Team Frosh Memorial Award"
      },
      {
        "name": "khaled-script",
        "link": "https://www.npmjs.com/package/khaled-script",
        "creator": "Arjun Balaji",
        "award": "Least Likely to Make Money"
      },
      {
        "name": "Emovi (by the Gettem Next Timers)",
        "link": "https://github.com/westinn/Emovi",
        "creator": "Daniel Cohen and Nicolas Westin",
        "award": "Most Fun Idea"
      },
      {
        "name": "Pecan",
        "link": "https://github.com/OmkarB/pecan",
        "creator": "Omkar Bhat, Ty Coghlan, Raj Narayan, and Kevin Liu",
        "award": "Best Use of Wolfram Technology"
      },
      {
        "name": "The Hound",
        "link": "https://github.com/coreycle/The-Hound",
        "creator": "Corey Clemente, Ebrahim Ebrahim, and Dillon Sienko",
        "award": "Indico's Prize"
      },
      {
        "name": "Happy",
        "link": "",
        "creator": "Rebecca Bagley, Karen Zheung, Zhihe Shen, Tammy Huynh, and Bjorn Shen"
      },
      {
        "name": "What's On My Plate (WOMP)",
        "link": "http://xiifulminata.github.io/WhatsOnMyPlate/",
        "creator": "Gary Calzada, Victoria Yang, Yifan Xing, Jovaun Jackson, and Monsurat Olaosebikan"
      },
      {
        "name": "Hack Connection",
        "link": "https://github.com/nathansomething/hack-connection",
        "creator": "Nathan Goodman, Angela Massey, Charlotte O'Neill, Logan Moore, and Emily Hontoria"
      },
      {
        "name": "Sharks and Minnows",
        "link": "https://github.com/dqgorelick/digital-ocean",
        "creator": "Chris DeLucia, Dan Gorelick, Huy Le, Cheyan Setayesh, Andy Shen, Kaitlen Sousa, and Simon Ton"
      },
      {
        "name": "metric-me",
        "link": "hacks.ramimac.me",
        "creator": "Rami McCarthy, Tom Kowalski, and David Shoyket"
      },
      {
        "name": "GamePackCast",
        "link": "https://github.com/alfred/hackbeanpot16",
        "creator": "Alfred Ababio, Matthew Capone, Brendan Ross, and Joseph Crotty"
      },
      {
        "name": "Long Story Short",
        "link": "https://github.com/bdatdo0601/StoryTelling",
        "creator": "Dat Bac Do, Kyle Frick, An Huynh, and Justin Wright"
      },
      {
        "name": "AfroCoding",
        "link": "https://github.com/agrundw/HackBeanpot2016",
        "creator": "Alex Grundwerg and Dorian Franklin"
      },
      {
        "name": "Matthias Madness",
        "link": "https://github.com/emilydaniel/Matthias-Madness.git",
        "creator": "Patrick Watrous"
      },
      {
        "name": "Snappage",
        "link": "",
        "creator": "Patrick Watrous"
      },
      {
        "name": "alejoseb",
        "link": "https://github.com/alejoseb/",
        "creator": "Alejandro Mera"
      },
      {
        "name": "Close Call",
        "link": "https://github.com/golf1052/close-call",
        "creator": "Nat Dempkowski, Andrew Knueven, Sanders Lauture, and Tevin Otieno"
      },
      {
        "name": "Ambeyonce",
        "link": "https://github.com/TheMichaelHu/Ambeyonce",
        "creator": "Michael Hu, Nikolai Wotton, Quan Do, and Kevin Luo"
      },
      {
        "name": "Startup Query Language",
        "link": "",
        "creator": "Michael Coppola"
      },
      {
        "name": "Team Giant Robot Dog",
        "link": "https://github.com/johncomposed/scheduleThis/",
        "creator": "Matthew Coleman, John Williams, and Max Lever"
      },
      {
        "name": "binfmt_mysc",
        "link": "https://github.com/mossberg/binfmt_mysc",
        "creator": "Mark Mossberg"
      },
      {
        "name": "A Hard G",
        "link": "https://github.com/genagain/vacant-feeds",
        "creator": "Gen Ohta"
      },
      {
        "name": "My Immortal Hotline",
        "link": "https://github.com/superjabenman/My-Immortal-Hotline",
        "creator": "Jaben McCormack"
      },
      {
        "name": "MealMate/Fanatic Four",
        "link": "https://github.com/Fanatic-Four/Meal-Mate",
        "creator": "Tommy Nguyen, Calvin Mei, Kayla Nguyen, and Michelle Chan"
      },
      {
        "name": "Gungho",
        "link": "https://github.com/Kibii/Gungho",
        "creator": "Catherine Feldman, Adam Mullarkey, James Yanyuk, and Michael Markman"
      },
      {
        "name": "Sassmates",
        "link": "https://github.com/nioushajafari/hackbeanpot-2016",
        "creator": "Adrian Kant, Niousha Jafari, and Jaclyn Iulianetti"
      },
      {
        "name": "Cai",
        "link": "",
        "creator": "Vignesh Mohankumar, and Eric Yu"
      },
      {
        "name": "AWSomeButton",
        "link": "https://github.com/stokesbga/AWSomeButton",
        "creator": "Alexey Shablygin and Alexander Stokes"
      },
      {
        "name": "statly",
        "link": "https://github.com/cwheel/statly",
        "creator": "James Sullivan and Cameron Wheeler"
      },
      {
        "name": "Addi",
        "link": "https://github.com/nickzuber/addi",
        "creator": "Danielle Nguyen and Nick Zuber"
      },
      {
        "name": "Relationship Tracker",
        "link": "https://github.com/marshallewhite/RelationshipTracker",
        "creator": "Marshall White"
      },
      {
        "name": "UFree",
        "link": "https://github.com/l-tn3314/UFree",
        "creator": "Tina Lee, Gabriel Centeno, Kristy Chen, and Trent Duffy"
      }
    ]
  }
]
