[
  {
    "title": "Innovation",
    "description":
      "We know your company is using new technology and tackling challenging problems. This kit is a great opportunity for you to provide a directed tech challenge for students at the event. You can share your technologies/APIs with excited participants or present a challenge that helps solve an issue aligning with your company's values.",
    "quote":
      "My favorite part was meeting a group of people in the same position as me and becoming friends and learning so much that way. It's cheesy, but it's true.",
    "credit": "Olivia, Past Attendee"
  },
  {
    "title": "Engagement",
    "description":
      "Many of our past sponsors' favorite part of their HackBeanpot experience was embracing the hackathon spirit. From hosting sponsored activities to mentoring or judging, if you love the idea of being hands-on and inspiring passionate students, a higher engagement level might be for you.",
    "quote":
      "Everyone was just really supportive in general, they were really jazzed about what they were doing... I’ve never been to a hackathon that is its own separate entity, and I thought that there was so much potential for growth that other hackathons don’t have. It was something I really want to be involved in.",
    "credit": "Warren, Past Attendee & HBP Organizer"
  },
  {
    "title": "Recruitment",
    "description":
      "HackBeanpot prides itself on being a hackathon that brings together talented students with curious minds from a wide range of backgrounds! This kit will connect you with the diverse talent pool of students at HackBeanpot and expand your network. Come chat about what's great about your company - whether it's the technology, the growth opportunities, or maybe even the loaded snack bar!",
    "quote":
      "Some of the HBP committee members came in and I was talking to them and saying I know zero code, and they were super excited about it and showed me resources for where I could learn.",
    "credit": "Brandon, Past Attendee"
  }
]
