[
  {
    "title": "Inspire",
    "description":
      "Our past sponsors’ favorite part of the HackBeanpot experience was in embracing the hackathon spirit. From mentorship, to judging, to running sponsored activities, if you love the idea of being hands-on and working face-to-face with hackers, this kit is for you.",
    "quote":
      "My favorite part was meeting a group of people in the same position as me and becoming friends and learning so much that way. It's cheesy, but it's true.",
    "credit": "Olivia, Past Attendee"
  },
  {
    "title": "Grow",
    "description":
      "We know you’re using new technology and creative methods to tackle problems the world has never seen before. This kit is a great opportunity for you to share your technologies and APIs with excited participants. You can introduce the next challenge that will inspire the upcoming generation of curious technologists.",
    "quote":
      "Everyone was just really supportive in general, they were really jazzed about what they were doing... I’ve never been to a hackathon that is its own separate entity, and I thought that there was so much potential for growth that other hackathons don’t have. It was something I really want to be involved in.",
    "credit": "Warren, Past Attendee & HBP Organizer"
  },
  {
    "title": "Recruit",
    "description":
      "HackBeanpot prides itself in being a hackathon that brings together curious minds, and we are excited to be a part of the growing Boston tech scene. We want to help bridge the gap between the two, and help you connect to a diverse talent pool of students. Come chat about what it’s like to work at your company — whether it be creative technology, growth opportunities, or maybe even just a loaded snack bar.",
    "quote":
      "Some of the HBP committee members came in and I was talking to them and saying I know zero code, and they were super excited about it and showed me resources for where I could learn.",
    "credit": "Brandon, Past Attendee"
  }
]
